'use strict';

// ===================== Розрахунок Коефіцієнту обліку опадів поточного дня (К) =====================================
//var    windSpeed= 2.8;

exports.windCoefCulc = function(windSpeed){
// Щоб уникнути надзвичайно складного галуження і проблем з інтерполяцією і екстраполяцією 
// цей коефіцієнт було вирахувано за наступною формулою 
// k = -0.0002*(x**3)+ 0.0038*(x**2)+ 0.0226*x + 0.9888 (поліном третього порядку) R2 = 0.999;
let windCoef;
windSpeed = windSpeed - 0;
windCoef = -0.0002*(Math.pow(windSpeed, 3)) + 0.0038*(windSpeed*windSpeed)+0.0226*windSpeed + 0.9888;

// Проводимо перевірку на перевищення допустимих значень коефіцієнта:
    if (windCoef > 1.48) {
        windCoef = 1.48;
        return windCoef;
    } else {
        return windCoef;
    }

};